;===========================================================================
;   RUSTY DETAILED SOLDIER LISTS LOCALISATION
;   CREATED 14/07/22 00:30  UPDATED 18/07/22 01:30
;===========================================================================
[X2EventListener_StatusOfDSLRusty]
strOfficerAlreadySelectedStatus="军官在小队"
strCommandingOfficer = "军官单位"

strSPARKAlreadySelectedStatus="SPARK在小队"
strSPARKUnit = "SPARK单位"

;===========================================================================

[MoreDetailsManager]
m_strToggleDetails="切换详细信息"
m_strShowLegend="切换图例"
m_strLegendTitle="图例"

m_strSection1="第一页姓名图标"
m_strSection2="第一页职业图标"
m_strSection3="第二页姓名图标"
m_strSection4="第二页职业图标"
m_StrSection5="其他图标"
m_strSectionR="武器图标"

m_strShieldsLabel="护盾"
m_strPCSLabel="个人战斗芯片插槽"
m_strSPARKLabel="SPARK"

m_strNaturalAptitude="自然天赋"

m_strNaturalAptitudeLabels[0]="普通" ;标准
m_strNaturalAptitudeLabels[1]="高质" ;高于平均
m_strNaturalAptitudeLabels[2]="极限" ;有天赋
m_strNaturalAptitudeLabels[3]="超人" ;天才
m_strNaturalAptitudeLabels[4]="半神" ;学者

m_strSkillPoints="士兵技能点"

;===========================================================================
;below is a list of weapon categories to translate for the LEGEND sidebar
;this list can be further expanded in the future with no need for code recompile!

[XGLocalisedData_DSL]

rifle="步枪"
sniper_rifle="狙击步枪"
cannon="加农炮"
shotgun="霰弹枪"
gauntlet="碎片拳刃"
vektor_rifle="维克托步枪"
bullpup="无托步枪"
SMG="冲锋枪"
pistol="手枪"
sword="近战武器"
gremlin="小精灵"
grenade_launcher="榴弹发射器"
claymore="阔剑地雷"
claymoreP="简易爆炸装置"
wristblade="裂爪刃"
sidearm="自动手枪"
psiamp="灵能增幅器"
replace_psiamp="灵能碎片"
psiamp_pm="灵魂宝石"
sparkrifle="SPARK步枪"
sparkbit="SPARK部件"
spark_shield="火花护盾"
combatknife="战斗匕首"
arcthrower="电弧发射器"
holotargeter="全息瞄准器"
lw_gauntlet="XCOM护手"
lwgauntlet="护手"
sawedoffshotgun="截短霰弹枪"
Heavy="重武器手"
psionicreaper="灵能收割者"
psigatlingrifle="灵能加特林机枪"
empty="空"
chemthrower="火焰喷射器"
canister="弹药罐"
iri_ordnance_launcher="SPARK军械发射器"
iri_kinetic_strike_module="动能打击模块"
iri_rocket_launcher="火箭发射器"
iri_disposable_launcher="一次性发射器"
shield="护盾"
proxrocket="普罗西安发射器"
proxwristblade="普罗西安利刃"
proxpalm="掌心爆能枪"
bioamp="生物增幅器"
stimgun="兴奋剂枪"
tanklin="坦克林"
holocron="全息方碑"
lightsaber="光剑"
saberstaff="双头光剑"
necrostaff="死灵法杖"
MysticStaff="神秘法杖"
glaive="战戟"
travellight="旅行灯"
teslarifle="特斯拉步枪"
bow="弓弩发射器"
boltcaster="螺栓发射器"
